kmcfate/yoass/sdkconfig.defaults.esp32s3
# ESP32-S3-specific sdkconfig defaults.
# Applied automatically when target is esp32s3.

CONFIG_IDF_TARGET="esp32s3"

# Flash: 16 MB QIO @ 80 MHz
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_ESPTOOLPY_FLASHMODE_QIO=y
CONFIG_ESPTOOLPY_FLASHFREQ_80M=y

# 8 MB octal PSRAM (ESP32-S3R8 stacked PSRAM)
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_SPEED_80M=y
CONFIG_SPIRAM_FETCH_INSTRUCTIONS=y
CONFIG_SPIRAM_RODATA=y
CONFIG_SPIRAM_TRY_ALLOCATE_WIFI_LWIP=y

# USB Serial/JTAG (native USB on S3)
CONFIG_ESP_CONSOLE_USB_SERIAL_JTAG=y
